# #+OPTIONS: d:nil

* DONE Classical Cipher
CLOSED: [2026-04-08 水 20:44]
:LOGBOOK:
- CLOSING NOTE [2026-04-08 水 20:44] \\
  #+begin_verse
  cpaw{Caesar_cipher_is_classical_cipher}
  #+end_verse
:END:

[[https://ctf.cpaw.site/questions.php?qnum=6][問題ページ]]

** ソルバー
#+begin_src C :results output :main no :tangle solve.c :cmdline fsdz{Fdhvdu_flskhu_lv_fodvvlfdo_flskhu} -3
#include <stdint.h>
#include <stdlib.h>
#include <stdio.h>
#include <ctype.h>

int32_t main(int32_t argc, char** argv) {
  /* 引数の簡易チェック */
  if(argc != 3) {
    return EXIT_FAILURE;
  }

  int32_t shift = atoi(argv[2]) % 26;
  /* マイナスにも対応 */
  if(shift < 0) { shift += 26; }

  for(int32_t i = 0; argv[1][i] != '\0'; i++) {
    /* 大文字の場合 */
    if(isupper(argv[1][i])) {
      printf("%c", (argv[1][i] - 'A' + shift) % 26 + 'A');
    }
    /* 小文字の場合 */
    else if (islower(argv[1][i])) {
      printf("%c", (argv[1][i] - 'a' + shift) % 26 + 'a');
    }
    /* 記号とかの場合 */
    else {
      printf("%c", argv[1][i]);
    }
  }
  return EXIT_SUCCESS;
}
#+end_src

#+RESULTS:
: cpaw{Caesar_cipher_is_classical_cipher}

** 環境
#+begin_src shell :results output :exports results
gcc --version|head -n 1
#+end_src

#+RESULTS:
: gcc (GCC) 15.2.0

* DONE Block Cipher
CLOSED: [2026-04-09 木 22:04]
:LOGBOOK:
- CLOSING NOTE [2026-04-09 木 22:04] \\
  #+begin_verse
  cpaw{Your_deciphering_skill_is_great}
  #+end_verse
:END:

[[https://ctf.cpaw.site/questions.php?qnum=20][問題ページ]]

実行時にフラグ、整数の順で引数を与える。

とりあえず動かしてみる。(なお、出力に特殊文字が含まれて、GitHub でうまく表示されないので、silent にしている。)

#+begin_src C :cmdline abcde_fghij_klnmo_pqrst 3 :results output silent :main no
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
int main(int argc, char* argv[]){
  int i;
  int j;
  int key = atoi(argv[2]);
  const char* flag = argv[1];
  printf("cpaw{");
  for(i = key - 1; i <= strlen(flag); i+=key) for(j = i; j>= i - key + 1; j--) printf("%c", flag[j]);
  printf("}");
  return 0;
}
#+end_src

指定した値で文字列を分割し、それぞれ逆にして出力することがわかった。

ここで、問題の文字列を眺めてみると、最初に大文字の Y があり、その前に ruo があることから、Your になると推測できる。
よって、 ~key~ となる値は 4 であると推測でき、復号には暗号化したときと同様の処理が使えるので、与えられたプログラムにそれぞれ渡す。
ちなみに手動で解くと以下のようになる。

#+begin_example
ruoYced_ehpigniriks_i_llrg_stae
#+end_example

#+begin_example
ruoY ced_ ehpi gnir iks_ i_ll rg_s tae
#+end_example

#+begin_example
Your _dec iphe ring _ski ll_i s_gr eat
#+end_example

#+begin_example
Your_deciphering_skill_is_great
#+end_example

#+begin_src C :cmdline ruoYced_ehpigniriks_i_llrg_stae 4 :results output silent :main no
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

int main(int argc, char* argv[]){
  int i;
  int j;
  int key = atoi(argv[2]);
  const char* flag = argv[1];
  printf("cpaw{");
  for(i = key - 1; i <= strlen(flag); i+=key) {
    for(j = i; j>= i - key + 1; j--) {
      printf("%c", flag[j]);
    }
  }
  printf("}");
  return 0;
}
#+end_src

** 環境
#+begin_src shell :results output :exports results
gcc --version|head -n 1
#+end_src

#+RESULTS:
: gcc (GCC) 15.2.0

* DONE Baby's SQLi - Stage 1-
CLOSED: [2026-04-09 木 22:38]
:LOGBOOK:
- CLOSING NOTE [2026-04-09 木 22:38] \\
  #+begin_verse
  cpaw{palloc_escape_from_stage1;(}
  #+end_verse
:END:

[[https://ctf.cpaw.site/questions.php?qnum=22][問題ページ]]

[[https://ctf.spica.bz/baby_sql/]]にて、以下のコードを実行するとフラグを得られる。

#+begin_src SQL
SELECT * FROM palloc_home;
#+end_src

* TODO Can you login？
まずはファイルの確認から。

#+begin_src shell :results output
file can-you-login/network100_be557d01b0299a03dd3569893226dda424efc9a0.pcap
#+end_src

#+RESULTS:
: can-you-login/network100_be557d01b0299a03dd3569893226dda424efc9a0.pcap: pcap capture file, microsecond ts (little-endian) - version 2.4 (Ethernet, capture length 262144)

#+begin_src shell :results output
strings can-you-login/network100_be557d01b0299a03dd3569893226dda424efc9a0.pcap | rg 'cpaw'
#+end_src

#+RESULTS:


* DONE またやらかした！
CLOSED: [2026-04-09 木 23:46]
:LOGBOOK:
- CLOSING NOTE [2026-04-09 木 23:46] \\
  #+begin_verse
  cpaw{vernam!!}
  #+end_verse
:END:

[[https://ctf.cpaw.site/questions.php?qnum=23][問題ページ]]

とりあえずファイルを調べる。

#+begin_src shell :results output
file again/rev200
#+end_src

#+RESULTS:
: again/rev200: ELF 32-bit LSB executable, Intel 80386, version 1 (SYSV), dynamically linked, interpreter /lib/ld-linux.so.2, for GNU/Linux 2.6.24, BuildID[sha1]=e87140105d6b5c8ea9b0193380ab3b79bfdcd85b, not stripped

Ghdra でデコンパイルした結果、以下のような出力が得られた。
どうやら配列に格納される各値を ~0x19~ と XOR 演算するとフラグの文字列になることがわかった。

なお、コードの 1 番はじめのループでは ~local_7c~ のうしろ半分の要素を 0 で初期化している。
そして、2番目のループで先述の演算結果を ~local_7c~ のうしろ半分へ格納している。
なので、 ~local_7c~ は要素数が ~[28]~ で宣言されている。

Python で実行するとフラグが得られた。

最後に格納される値である ~100~ は十進数なので、変換することを忘れずに。

#+begin_src C :main no
undefined4 main(void)

{
  int iVar1;
  uint *puVar2;
  int local_84;
  uint local_7c [28];

  local_7c[0] = 0x7a;
  local_7c[1] = 0x69;
  local_7c[2] = 0x78;
  local_7c[3] = 0x6e;
  local_7c[4] = 0x62;
  local_7c[5] = 0x6f;
  local_7c[6] = 0x7c;
  local_7c[7] = 0x6b;
  local_7c[8] = 0x77;
  local_7c[9] = 0x78;
  local_7c[10] = 0x74;
  local_7c[0xb] = 0x38;
  local_7c[0xc] = 0x38;
  local_7c[0xd] = 100;
  puVar2 = local_7c + 0xe;
  for (iVar1 = 0xe; iVar1 != 0; iVar1 = iVar1 + -1) {
    *puVar2 = 0;
    puVar2 = puVar2 + 1;
  }
  for (local_84 = 0; local_84 < 0xe; local_84 = local_84 + 1) {
    local_7c[local_84 + 0xe] = local_7c[local_84] ^ 0x19;
  }
  return 0;
}
#+end_src

#+begin_src python :results output
print(hex(100))
#+end_src

#+RESULTS:
: 0x64

#+begin_src python :results output
c = [0x7a, 0x69, 0x78, 0x6e, 0x62, 0x6f, 0x7c, 0x6b, 0x77, 0x78, 0x74, 0x38, 0x38, 0x64]

for i in c:
    print(chr(i ^ 0x19), end="")
#+end_src

#+RESULTS:
: cpaw{vernam!!}
